module.exports = {
  exps: [
    {
      companyName: '浙江启程电子科技股份有限公司',
      startTime: '2016-08',
      endTime: '2017-04',
      jd: '全栈开发',
      projects: [
        {
          feature: '一个月为金丽温高速信息公司开发一套web后台管理系统。团队小而精，两个web端（包含我）一安卓一iOS。我负责巡检模块的全栈开发，主要包括工作内容有MySQL数据库建表，mybatis做DAO层开发，用jq、avalon、bootstrap、百度地图JSSDK等等各种三方库做视图层，springmvc路由映射做分发。（虽然后面不会再接触java的技术，但也是一种沉淀）',
          advantage: '功能性，无数据量化',
          benifit: '（较强的学习能力）我曾在短时间内自学avalon并以数据绑定式来实现IM前端应用'
        },
        {
          feature: '重构项目。一期使用adobe的flex和c#，为了易于维护，使用adminLTE UI框架、webpack和h5plus重构此项目。pc端在重构时参考阿里云多页后台实现，使用webpack将系统工程化，核心思路就是抽象出共性代码片段，并自动拼装出多页面。（其实就是gulp的自动化构建）。另使用h5plus重构app端。（一套类似京东Taro的多端解决方案，实际会存在兼容性问题，且无法解放DOM操作）',
          advantage: '功能性，无数据量化',
          benifit: '具有工程化的实际动手搭建的能力'
        }
      ]
    },
    {
      companyName: '杭州传送门网络科技有限公司',
      startTime: '2017-06',
      endTime: '2018-07',
      jd: '前端开发',
      projects: [
        {
          feature: '活动系统前端。作为唯一开发人员，自学并使用vue开发，其中依赖echarts等多个第三方库。体验地址https://open.welian.com。自己使用webpack搭建多页工程并独立开发，精细还原设计稿（支持h5活动报名、支付、签到等完整闭环流程，具体业务形态可参考活动行）',
          advantage: '支持万数量级活动的正常举办',
          benifit: '具有较强的自学能力。自己设计并实现了在PC端可配置主题官网，并配套响应式的h5页面展示。（虽然实际使用较少，这是一个典型的投入产出比有问题的伪需求，实际上此功能的灵活定制性、可扩展性、易用性不满足用户需求，比较好的方案请参考后续我的一次项目经验）'
        },
        {
          feature: '课程小程序。作为主程，实现了核心的播放功能，类知乎、得到。体验请在微信中搜索微链学堂。',
          advantage: '支撑公司知识付费业务',
          benifit: '开发课程播放功能中会遇到很多问题，但都能解决掉。具有较强的独立开发能力以及问题解决能力'
        },
        {
          feature: '活动小程序。作为唯一开发人员，负责前端工作中从框架搭建到落地上线的所有流程。体验请在微信中搜索微链活动平台',
          advantage: '活动h5页面的小程序版本',
          benifit: '具有较强的抽象能力。比如开发小程序过程中未使用三方UI库，然后自己动手实现Form表单组件封装包含有取值、规则校验、错误钩子等'
        }
      ]
    },
    {
      companyName: '杭州兑吧网络科技有限公司',
      startTime: '2018-07',
      endTime: '至今',
      jd: '前端支撑',
      projects: [
        {
          feature: '积木系统升级版。落地页制作工具，类似墨刀、h5ds等等。自学React，Mobx，React-DnD等技术，然后前期从技术调研、系统框架设计到独立开发与实际落地均独立完成，并且编写博客为后面可进行技术分享，详见https://blog.qingf.me/?p=964，后续会更新到掘金等社区以提高自己的技术影响力',
          advantage: '保质完成公司设计部门建站工具的需求',
          benifit: '有较浓的技术兴趣，旨在提高技术影响力，除了可为团队技术沉淀贡献一份力量之外，还可带领2-3人的小team'
        }
      ]
    }
  ]
}
